# Activity 2

### The employee (emp) dataset and the department (dept) dataset share a department number (DEPTNO) column. Let's merge and analyze the two datasets

In [18]:
import pandas as pd

df = pd.read_csv('../../data/emp.csv')
df

    EMPNO            ENAME      JOB  DEPTNO   SAL
0    1001       John Smith  Manager      10  6000
1    1002        Susan Lee  Analyst      20  3500
2    1003       Alan Brown    Clerk      10  2100
3    1004      Karen White    Sales      30  4000
4    1005      James Green    Clerk      20  2200
5    1006      Linda Black  Manager      30  6200
6    1007     Michael Blue  Analyst      10  3400
7    1008      Jessica Red    Sales      20  4200
8    1009    Robert Yellow    Clerk      30  2300
9    1010  Patricia Purple  Manager      20  5900
10   1011     David Orange    Sales      10  3900
11   1012      Alice Brown    Clerk      20  2100
12   1013        Tom White  Manager      30  6300
13   1014       Emma Green  Analyst      10  3600
14   1015      Chris Black    Clerk      20  2300
15   1016       Nancy Blue    Sales      30  4100
16   1017        Steve Red  Analyst      10  3550
17   1018     Sarah Yellow  Manager      20  5800
18   1019     Brian Purple    Clerk      30  2400
19   1020     Laura Orange    Sales      10  4100
20   1021      Peter Brown    Clerk      20  2350
21   1022       Lisa White  Manager      30  6400
22   1023       Mark Green  Analyst      10  3700
23   1024      Julia Black    Clerk      20  2250
24   1025        Paul Blue    Sales      30  4150
25   1026         Anna Red  Analyst      10  3450
26   1027     Kevin Yellow  Manager      20  5700
27   1028    Rachel Purple    Clerk      30  2500
28   1029    Daniel Orange    Sales      10  4200
29   1030     Monica Brown    Clerk      20  2200
30   1031     George White  Manager      30  6500
31   1032      Karen Green  Analyst      10  3650
32   1033      Frank Black    Clerk      20  2400
33   1034       Diana Blue    Sales      30  4300
34   1035         Luke Red  Analyst      10  3900
35   1036     Megan Yellow  Manager      20  5650
36   1037     Oscar Purple    Clerk      30  2550
37   1038    Sophie Orange    Sales      10  4300
38   1039      Henry Brown    Clerk      20  2450
39   1040      Linda White  Manager      30  6600
40   1041       Jack Green  Analyst      10  3750
41   1042     Olivia Black    Clerk      20  2500
42   1043        Liam Blue    Sales      30  4400
43   1044        Chloe Red  Analyst      10  3950
44   1045     Ethan Yellow  Manager      20  5600
45   1046       Mia Purple    Clerk      30  2600
46   1047      Noah Orange    Sales      10  4400
47   1048        Ava Brown    Clerk      20  2550
48   1049    William White  Manager      30  6700
49   1050      Emily Green  Analyst      10  4000
50   1051        Ben Black    Clerk      20  2600
51   1052      Sophia Blue    Sales      30  4500
52   1053        Tommy Red  Analyst      10  4100
53   1054     Janet Yellow  Manager      20  5550
54   1055    Oliver Purple    Clerk      30  2650

In [19]:
# merge emp and dept based on department number, save them in df, and check the contents of df
dept = pd.read_csv('../../data/dept.csv')

df = pd.merge(df, dept, on='DEPTNO')

df

    EMPNO            ENAME      JOB  DEPTNO   SAL    DNAME        LOC
0    1001       John Smith  Manager      10  6000  Finance   New York
1    1002        Susan Lee  Analyst      20  3500    Sales     London
2    1003       Alan Brown    Clerk      10  2100  Finance   New York
3    1004      Karen White    Sales      30  4000       HR  Singapore
4    1005      James Green    Clerk      20  2200    Sales     London
5    1006      Linda Black  Manager      30  6200       HR  Singapore
6    1007     Michael Blue  Analyst      10  3400  Finance   New York
7    1008      Jessica Red    Sales      20  4200    Sales     London
8    1009    Robert Yellow    Clerk      30  2300       HR  Singapore
9    1010  Patricia Purple  Manager      20  5900    Sales     London
10   1011     David Orange    Sales      10  3900  Finance   New York
11   1012      Alice Brown    Clerk      20  2100    Sales     London
12   1013        Tom White  Manager      30  6300       HR  Singapore
13   1014       Emma Green  Analyst      10  3600  Finance   New York
14   1015      Chris Black    Clerk      20  2300    Sales     London
15   1016       Nancy Blue    Sales      30  4100       HR  Singapore
16   1017        Steve Red  Analyst      10  3550  Finance   New York
17   1018     Sarah Yellow  Manager      20  5800    Sales     London
18   1019     Brian Purple    Clerk      30  2400       HR  Singapore
19   1020     Laura Orange    Sales      10  4100  Finance   New York
20   1021      Peter Brown    Clerk      20  2350    Sales     London
21   1022       Lisa White  Manager      30  6400       HR  Singapore
22   1023       Mark Green  Analyst      10  3700  Finance   New York
23   1024      Julia Black    Clerk      20  2250    Sales     London
24   1025        Paul Blue    Sales      30  4150       HR  Singapore
25   1026         Anna Red  Analyst      10  3450  Finance   New York
26   1027     Kevin Yellow  Manager      20  5700    Sales     London
27   1028    Rachel Purple    Clerk      30  2500       HR  Singapore
28   1029    Daniel Orange    Sales      10  4200  Finance   New York
29   1030     Monica Brown    Clerk      20  2200    Sales     London
30   1031     George White  Manager      30  6500       HR  Singapore
31   1032      Karen Green  Analyst      10  3650  Finance   New York
32   1033      Frank Black    Clerk      20  2400    Sales     London
33   1034       Diana Blue    Sales      30  4300       HR  Singapore
34   1035         Luke Red  Analyst      10  3900  Finance   New York
35   1036     Megan Yellow  Manager      20  5650    Sales     London
36   1037     Oscar Purple    Clerk      30  2550       HR  Singapore
37   1038    Sophie Orange    Sales      10  4300  Finance   New York
38   1039      Henry Brown    Clerk      20  2450    Sales     London
39   1040      Linda White  Manager      30  6600       HR  Singapore
40   1041       Jack Green  Analyst      10  3750  Finance   New York
41   1042     Olivia Black    Clerk      20  2500    Sales     London
42   1043        Liam Blue    Sales      30  4400       HR  Singapore
43   1044        Chloe Red  Analyst      10  3950  Finance   New York
44   1045     Ethan Yellow  Manager      20  5600    Sales     London
45   1046       Mia Purple    Clerk      30  2600       HR  Singapore
46   1047      Noah Orange    Sales      10  4400  Finance   New York
47   1048        Ava Brown    Clerk      20  2550    Sales     London
48   1049    William White  Manager      30  6700       HR  Singapore
49   1050      Emily Green  Analyst      10  4000  Finance   New York
50   1051        Ben Black    Clerk      20  2600    Sales     London
51   1052      Sophia Blue    Sales      30  4500       HR  Singapore
52   1053        Tommy Red  Analyst      10  4100  Finance   New York
53   1054     Janet Yellow  Manager      20  5550    Sales     London
54   1055    Oliver Purple    Clerk      30  2650       HR  Singapore

In [20]:
# create a pivot table where rows are department locations (LOC), columns are jobs (JOB), and values are the sum of salaries (SAL)
pivot_table = df.pivot_table(values='SAL', index='LOC', columns='JOB', aggfunc='sum', fill_value=0)
pivot_table

JOB        Analyst  Clerk  Manager  Sales
LOC
London        3500  25900    34200   4200
New York     41050   2100     6000  20900
Singapore        0  15000    38700  25450

In [21]:
# create a pivot table where the rows are the department names (DNAME), the columns are the job (JOB), and the values are the sum of employees (ENAME)
pivot_table = df.pivot_table(values='ENAME', index='DNAME', columns='JOB', aggfunc='count', fill_value=0)
pivot_table

JOB      Analyst  Clerk  Manager  Sales
DNAME
Finance       11      1        1      5
HR             0      6        6      6
Sales          1     11        6      1